HEADER.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>2011 Research Tools</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-09-11 22:34:13 EDT"/>
<meta name="author" content="Kurt Schwehr"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">2011 Research Tools</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Introduction </h2>
<div class="outline-text-2" id="text-1">


<p>
These chapters are being created for the 2011 Research Tools course.
They are extremely rough.  If you give them a read, I would appreciate
any kind of feedback that you are willing to offer.  The goal is to
give students skills that will help them conquer data throughout their
career.  I am hoping to get this wrapped together as a book that
people can take with them when they leave CCOM.  I am releasing all
course material under a creative commons non-commercial license, so
that you can pass copies to your co-workers.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Course Materials </h2>
<div class="outline-text-2" id="text-2">


<ul>
<li>
<a href="audio">Audio podcasts of class</a>
</li>
<li>
VMWare <a href="virtual-machines">Ubuntu Virtual Machines</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Lectures: </h2>
<div class="outline-text-2" id="text-3">


<table  border="1" cellspacing="0" cellpadding="6" rules="all" frame="all">
<caption></caption>
<colgroup><col class="right" /><col class="right" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">No.</th><th scope="col" class="right">Date</th><th scope="col" class="left">Title/Notes</th><th scope="col" class="left">Audio/Podcast</th></tr>
</thead>
<tbody>
<tr><td class="right">1.</td><td class="right">2011-08-30</td><td class="left"><a href="./1-introduction.html" border="1" rules="all" frame="all">Introduction</a> (draft)</td><td class="left">[ <a href="#audio/1-introduction.mp3" border="1" rules="all" frame="all">mp3</a> ][ <a href="#audio/1-introduction.m4a" border="1" rules="all" frame="all">m4a</a> ][ <a href="#audio/1-introduction.ogg" border="1" rules="all" frame="all">ogg</a> ]</td></tr>
<tr><td class="right">2.</td><td class="right">2011-09-01</td><td class="left"><a href="./2-irc-wiki-basic-shell.html" border="1" rules="all" frame="all">IRC, Wiki, Basic Shell</a> (draft)</td><td class="left">[ <a href="#audio/2-irc-wiki-basic-shell.mp3" border="1" rules="all" frame="all">mp3</a> ][ <a href="#audio/2-irc-wiki-basic-shell.m4a" border="1" rules="all" frame="all">m4a</a> ][ <a href="#audio/2-irc-wiki-basic-shell.ogg" border="1" rules="all" frame="all">ogg</a> ]</td></tr>
<tr><td class="right">3.</td><td class="right">2011-09-06</td><td class="left"><a href="./3-basic-command-line.html" border="1" rules="all" frame="all">Wiki editing, Weather Demo, Basic Command Line</a> (draft)</td><td class="left">[ <a href="#audio/3-wiki-weather-shell.mp3" border="1" rules="all" frame="all">mp3</a> ][ <a href="#audio/3-wiki-weather-shell.m4a" border="1" rules="all" frame="all">m4a</a> ][ <a href="#audio/3-wiki-weather-shell.ogg" border="1" rules="all" frame="all">ogg</a> ]</td></tr>
<tr><td class="right">4.</td><td class="right">2011-09-08</td><td class="left">VMWare Ubuntu Image (<b>Coming soon</b>)</td><td class="left">[ <a href="#audio/4-vmware-ubuntu-virtual-machine.mp3" border="1" rules="all" frame="all">mp3</a> ][ <a href="#audio/4-vmware-ubuntu-virtual-machine.m4a" border="1" rules="all" frame="all">m4a</a> ][ <a href="#audio/4-vmware-ubuntu-virtual-machine.ogg" border="1" rules="all" frame="all">ogg</a> ]</td></tr>
</tbody>
</table>




</div>
</div>
<div id="postamble">
<p class="author"> Author: Kurt Schwehr
</p>
<p class="date"> Date: 2011-09-11 22:34:13 EDT</p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 23</p>
</div>
</div>
</body>
</html>
